package algorithm.F1;

public class S65 {
    public int add(int a, int b) {
        // 我二进制还可以嘛，这道题第一次做也能直接推出来，主要肯定是按位与和按位异或，猜的猜得到了，就是忘记考虑补码了
        // 一开始用的b>0的终止条件，没考虑b可能负数，哎，调了半天
        // 1111
        // 0001

        // 还有补码，好烦
        //   1111  -1
        //   0010  2
        //   0001
        //
        //  c0100
        //  x1101

        //   1000
        //   1001
        //   0000
        //   0001

        while (b != 0) {
            int carry = (a & b) << 1;
            a = a ^ b;
            b = carry;
        }
        return a;
    }
}
